Revit 2027 API
BuiltInFailures.TrussFailures.TrussUserDefinedMemberNotJoined Property
 Both start and end of web must intersect the truss.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TrussUserDefinedMemberNotJoined { get; }
Public Shared ReadOnly Property TrussUserDefinedMemberNotJoined As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TrussUserDefinedMemberNotJoined {
	FailureDefinitionId^ get ();
}
static member TrussUserDefinedMemberNotJoined : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.TrussFailures Class
Autodesk.Revit.DB Namespace